# -*- coding:utf-8 -*-
# ##################################################
# 函数：LU分解，QR分解， Householder约减，Givens约减
# 作者：余文艳(2015E8007361074)
# 日期：2016.5.17
# 输入：矩阵A
# 输出：所选择矩阵A对应分解或约减后的结果
# 实例：A=[2 0 -1; -1 1 1; -1 2 2]
#       A=[1 2 -3 4; 4 8 12 -8; 2 3 2 1; -3 -1 1 -4]
# ###################################################

print "温馨提示：1.请保证您正处于英文输入状态 2.请您参照下面给出的说明进行相应操作"
print "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -"
print "请您选择所需要进行的变换：（输入变换前的阿拉伯数字即可1、2、3、4）"
print "【1】LU 分解"
print "【2】QR 分解"
print "【3】Householder 约简"
print "【4】Givens 约简"

inputNum = raw_input("请选择：")
print "- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -"

print inputNum
